{"modelTopology":{"class_name":"Model","config":{"name":"model2","layers":[{"name":"input2","class_name":"InputLayer","config":{"batch_input_shape":[null,256],"dtype":"float32","sparse":false,"name":"input2"},"inbound_nodes":[]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":3840,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["input2",0,0,{}]]]},{"name":"reshape_Reshape1","class_name":"Reshape","config":{"target_shape":[4,4,240],"name":"reshape_Reshape1","trainable":true},"inbound_nodes":[[["dense_Dense2",0,0,{}]]]},{"name":"up_sampling2d_UpSampling2D1","class_name":"UpSampling2D","config":{"size":[2,2],"data_format":"channels_last","name":"up_sampling2d_UpSampling2D1","trainable":true},"inbound_nodes":[[["reshape_Reshape1",0,0,{}]]]},{"name":"conv2d_Conv2D5","class_name":"Conv2D","config":{"filters":200,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D5","trainable":true},"inbound_nodes":[[["up_sampling2d_UpSampling2D1",0,0,{}]]]},{"name":"up_sampling2d_UpSampling2D2","class_name":"UpSampling2D","config":{"size":[2,2],"data_format":"channels_last","name":"up_sampling2d_UpSampling2D2","trainable":true},"inbound_nodes":[[["conv2d_Conv2D5",0,0,{}]]]},{"name":"conv2d_Conv2D6","class_name":"Conv2D","config":{"filters":160,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D6","trainable":true},"inbound_nodes":[[["up_sampling2d_UpSampling2D2",0,0,{}]]]},{"name":"up_sampling2d_UpSampling2D3","class_name":"UpSampling2D","config":{"size":[2,2],"data_format":"channels_last","name":"up_sampling2d_UpSampling2D3","trainable":true},"inbound_nodes":[[["conv2d_Conv2D6",0,0,{}]]]},{"name":"conv2d_Conv2D7","class_name":"Conv2D","config":{"filters":120,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D7","trainable":true},"inbound_nodes":[[["up_sampling2d_UpSampling2D3",0,0,{}]]]},{"name":"up_sampling2d_UpSampling2D4","class_name":"UpSampling2D","config":{"size":[2,2],"data_format":"channels_last","name":"up_sampling2d_UpSampling2D4","trainable":true},"inbound_nodes":[[["conv2d_Conv2D7",0,0,{}]]]},{"name":"conv2d_Conv2D8","class_name":"Conv2D","config":{"filters":15,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D8","trainable":true},"inbound_nodes":[[["up_sampling2d_UpSampling2D4",0,0,{}]]]},{"name":"conv2d_Conv2D9","class_name":"Conv2D","config":{"filters":3,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D9","trainable":true},"inbound_nodes":[[["conv2d_Conv2D8",0,0,{}]]]},{"name":"activation_Activation1","class_name":"Activation","config":{"activation":"sigmoid","name":"activation_Activation1","trainable":true},"inbound_nodes":[[["conv2d_Conv2D9",0,0,{}]]]}],"input_layers":[["input2",0,0]],"output_layers":[["activation_Activation1",0,0]]},"keras_version":"tfjs-layers 2.8.4","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2/kernel","shape":[256,3840],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[3840],"dtype":"float32"},{"name":"conv2d_Conv2D5/kernel","shape":[3,3,240,200],"dtype":"float32"},{"name":"conv2d_Conv2D5/bias","shape":[200],"dtype":"float32"},{"name":"conv2d_Conv2D6/kernel","shape":[3,3,200,160],"dtype":"float32"},{"name":"conv2d_Conv2D6/bias","shape":[160],"dtype":"float32"},{"name":"conv2d_Conv2D7/kernel","shape":[3,3,160,120],"dtype":"float32"},{"name":"conv2d_Conv2D7/bias","shape":[120],"dtype":"float32"},{"name":"conv2d_Conv2D8/kernel","shape":[3,3,120,15],"dtype":"float32"},{"name":"conv2d_Conv2D8/bias","shape":[15],"dtype":"float32"},{"name":"conv2d_Conv2D9/kernel","shape":[3,3,15,3],"dtype":"float32"},{"name":"conv2d_Conv2D9/bias","shape":[3],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.8.4","convertedBy":null}